#define _CRT_SECURE_NO_WARNINGS 1
//
//#include <stdio.h>
//
////在计算机中整形在内存的存储
////原码、反码、补码
//int main()
//{
//	int a = 30;
//	//a的原码、反码、补码均为：00000000 00000000 00000000 00011110
//	int b = -20;
//	//b的原码：10000000 00000000 00000000 00010100
//	//b的反码：11111111 11111111 11111111 11101011
//	//b的补码：11111111 11111111 11111111 11101100
//
//	int c = a + b;
//	//a+b:
//	//00000000 00000000 00000000 00011110
//	//11111111 11111111 11111111 11101100
//   //+
//	//00000000 00000000 00000000 00001010 ->10
//	return 0;
//}


// 编写程序，判断当前的机器为大端机还是小端机；

////截断
//#include <stdio.h>
// 
//int main()
//{
//	int val = 1;
//	char ch = val;//发生了截断，将最后一个字节给了ch
//	if (ch)//如果是0，就是大端机
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//}

//强转
//#include <stdio.h>
//int main()
//{
//	int i = 1;
//	//在这里将i的地址的首元素强转为char* ，1个字节，然后解引用找到，判断是否为1
//	if (*(char*)&i)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
