

//整形提升和截断的再理解

//1:
//结果是，a = -1，b = -1，c = 255，这是为什么呢？
//- 1在内存中的存储补码为：11111111 11111111 11111111 11111111
//
//- 1转换为char a需要发生截断，截断后为：1111 1111，但是在输出的时候，是按照%d整型打印，所以需要整形提升，是有符号数补符号位，高位补1，
//即：11111111 11111111 11111111 11111111 ——> -1
//
//- 1转换为signed char b需要发生截断，截断后为：1111 1111, 但是在输出的时候，是按照%d整型打印，所以需要整形提升，是有符号数，补符号位，高位补1，
//即：11111111 11111111 11111111 11111111 ——> -1
//
//- 1转换为unsigned char c需要发生截断 ，截断后为：1111 1111, 但是在输出的时候，是按照%d整型打印，所以需要整形提升，是无符号数高位补0，
//即：00000000 00000000 00000000 11111111 ——> 255

//#include <stdio.h>
// 
//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d b=%d c=%d\n", a, b, c);
//	return 0;
//}

//2.
//-128在内存中的存储补码为：11111111 11111111 11111111 10000000
//转换为char型，发生了截断，变为：10000000；
//按照%u打印，先进行整形提升，是有符号数，补位符号位，
//变成：11111111 11111111 11111111 10000000
//最后按照无符号数打印，最高位不是符号位了，所以结果是2 ^ 32 -127
//#include <stdio.h>
//int main()
//{
//	char a = -128;
//	printf("%u\n", a);
//
//	return 0;
//}

//3、
//128在内存中的存储补码为：00000000 00000000 00000000 10000000
//转换为有符号的char型，发生了截断，变为：10000000；
//按照%u打印，先进行整形提升，是有符号数，补位符号位，
//变成：11111111 11111111 11111111 10000000
//最后按照无符号数打印，最高位不是符号位了，所以结果是2 ^ 32 ^ -127

//#include <stdio.h>
//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//
//	return 0;
//}


//4
//i的原码：10000000 00000000 00000000 00010100
//i的补码：11111111  11111111  11111111 11101100
//j的补码：00000000 00000000 00000000 00001010
//相加：11111111 11111111 11111111 11110110
//按照%d有符号的打印，则：结果为 - 10
//其实在无符号和有符号数相加的时候发生了 == 隐式类型转换，往大了转 == 。
//11111111 11111111 11111111 11101100
//00000000 00000000 00000000 00001010

//11111111 11111111 11111111 11110110
//#include <stdio.h>
//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//
//	return 0;
//}



//5、
//#include<stdio.h>
//int main()
//{
//	unsigned int i;
//	for  (i = 9; i >=0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}
//#include <stdio.h>
//#include <math.h> 
//int main()
//{
//	int input = 0;
//	scanf("%d", &input);
//	//遍历这些数
//	for (int i = 0; i < input; i++)
//	{
//		//求这个数的位数
//		int n = i;
//		int count = 1;
//		while (n > 9)
//		{
//			count++;
//			n /= 10;
//		}
//		//求和
//		int m = i;
//		int sum = 0;
//		while (m)
//		{
//			int a = m % 10;
//			sum += (int)pow(a, count);
//			m /= 10;
//		}
//		//判断是否相等
//		if (i == sum)
//		{
//			printf("%d ", i);
//		}
//	}
//	printf("\n");
//	return 0;
//}

//#include <stdio.h>
//
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));
//	return 0;
//}

#include <stdio.h>
int main()
{
	unsigned char i = 0;
	for ( i = 0; i <= 255 ; i++)
	{
		printf("hello world\n");
	}

	return 0;
}